title: User Group Membership Changed
id: rule-group-changed
status: stable
description: A user was added to or removed from a group
author: SigmaHQ (adapted for Sentinel)
date: 2024/01/01
tags:
  - attack.persistence
  - attack.t1098
  - account
logsource:
  product: linux
  service: auth
detection:
  selection:
    program|equals: "usermod"
  condition: selection
level: medium
enabled: true
event_types:
  - 4
